#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkEvents

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CosmeticsFrameworkEvents.CosmeticsEventRegistrar
// 0x0000 (0x0000 - 0x0000)
class ICosmeticsEventRegistrar final
{
public:
	struct FCosmeticsEventHandle RegisterOnCosmeticApplicationCompleted_BP(const TDelegate<void(const TScriptInterface<class ICosmeticsEventRegistrar>& EventTarget)>& Delegate, int32 Flags_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticsEventRegistrar">();
	}
	static class ICosmeticsEventRegistrar* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticsEventRegistrar>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICosmeticsEventRegistrar) == 0x000001, "Wrong alignment on ICosmeticsEventRegistrar");
static_assert(sizeof(ICosmeticsEventRegistrar) == 0x000001, "Wrong size on ICosmeticsEventRegistrar");

// Class CosmeticsFrameworkEvents.CosmeticsFinishable
// 0x0000 (0x0000 - 0x0000)
class ICosmeticsFinishable final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticsFinishable">();
	}
	static class ICosmeticsFinishable* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticsFinishable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICosmeticsFinishable) == 0x000001, "Wrong alignment on ICosmeticsFinishable");
static_assert(sizeof(ICosmeticsFinishable) == 0x000001, "Wrong size on ICosmeticsFinishable");

// Class CosmeticsFrameworkEvents.CosmeticsMeshTarget
// 0x0000 (0x0000 - 0x0000)
class ICosmeticsMeshTarget final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticsMeshTarget">();
	}
	static class ICosmeticsMeshTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticsMeshTarget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICosmeticsMeshTarget) == 0x000001, "Wrong alignment on ICosmeticsMeshTarget");
static_assert(sizeof(ICosmeticsMeshTarget) == 0x000001, "Wrong size on ICosmeticsMeshTarget");

// Class CosmeticsFrameworkEvents.CosmeticsStreaming
// 0x0000 (0x0000 - 0x0000)
class ICosmeticsStreaming final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticsStreaming">();
	}
	static class ICosmeticsStreaming* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticsStreaming>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICosmeticsStreaming) == 0x000001, "Wrong alignment on ICosmeticsStreaming");
static_assert(sizeof(ICosmeticsStreaming) == 0x000001, "Wrong size on ICosmeticsStreaming");

}

