#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_VoidRedemption_Rebel_AnimBP

#include "Basic.hpp"

#include "F_MED_VoidRedemption_Rebel_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_VoidRedemption_Rebel_AnimBP.F_MED_VoidRedemption_Rebel_AnimBP_C
// 0x84E0 (0x8C00 - 0x0720)
class UF_MED_VoidRedemption_Rebel_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct F_MED_VoidRedemption_Rebel_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0728(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_72B[0x5];                                      // 0x072B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0738(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0740(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0760(0x0150)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x08B0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x09B8(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x09D8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x0AE0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0BE8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0CF0(0x0108)()
	uint8                                         Pad_DF8[0x8];                                      // 0x0DF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_5;                         // 0x0E00(0x0960)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1760(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1C70(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x2180(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2690(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2BA0(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_4;                         // 0x30B0(0x0960)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x3A10(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x3A30(0x0960)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x4390(0x0478)(ContainsInstancedReference)
	uint8                                         Pad_4808[0x8];                                     // 0x4808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x4810(0x0960)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x5170(0x0478)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x55E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x56F0(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x5818(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x5840(0x0478)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5CB8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5D30(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x5D58(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x5D78(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5DC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x5DE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5E00(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x5E20(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x5F28(0x0028)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x5F50(0x0960)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x68B0(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x68F8(0x0478)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6D70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x6D90(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x6DB0(0x0478)(ContainsInstancedReference)
	uint8                                         Pad_7228[0x8];                                     // 0x7228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x7230(0x0960)()
	double                                        __CustomProperty_is_NOT_Moving_2d_1BBCF32C4DA60949C8640B89731068F1; // 0x7B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_is_NOT_Moving_2d_ED52AE82435AB34682DB20BEE48EB678; // 0x7B98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x7BA0(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride;                                   // 0x8358(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        isCrouch;                                          // 0x8370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delta_Time_X;                                      // 0x8378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         Mesh;                                              // 0x8380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               dynamic_mat_instance;                              // 0x8388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               dynamic_overlay_mat;                               // 0x8390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Velocity_Transform_Location_reg1;         // 0x8398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Velocity_Transform_Velocity_reg1;         // 0x83B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Velocity_Transform_Location_reg2;         // 0x83C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Previous_Velocity_Transform_Velocity_reg2;         // 0x83E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Velocity_Interp_Speed_reg1;                        // 0x83F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         wind_strength;                                     // 0x8400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurbulenceNoiseTileDivisor;                        // 0x8404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Velocity_Interp_Speed_reg2;                        // 0x8408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        is_NOT_Moving_2d;                                  // 0x8410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Is_Tactiacal_Sprint_OR_Crouch_AND_Move2D;          // 0x8418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimPhysSimSpaceType                         AnimDynamics_SimSpace_Frontend;                    // 0x8420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8421[0x7];                                     // 0x8421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Anim_Dynamics_Alpha_Frontend;                      // 0x8428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGravityOverrideParamsStruct           Gravity_Override_Params_2;                         // 0x8430(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride_2;                                 // 0x8BE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP(int32 EntryPoint);
	void OnCharacterCustomizationLoaded(const class USkeletalMeshComponent* CustomBaseMesh, const TArray<class UCustomCharacterPart*>& CustomParts, const TArray<class USkeletalMeshComponentBudgeted*>& CustomMeshParts);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_VoidRedemption_Rebel_AnimBP_C">();
	}
	static class UF_MED_VoidRedemption_Rebel_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_VoidRedemption_Rebel_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_VoidRedemption_Rebel_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_VoidRedemption_Rebel_AnimBP_C");
static_assert(sizeof(UF_MED_VoidRedemption_Rebel_AnimBP_C) == 0x008C00, "Wrong size on UF_MED_VoidRedemption_Rebel_AnimBP_C");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, UberGraphFrame) == 0x000720, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, __AnimBlueprintMutables) == 0x000728, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000730, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimBlueprintExtension_Base) == 0x000738, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Root) == 0x000740, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000760, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_6) == 0x0008B0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_LocalToComponentSpace_3) == 0x0009B8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_5) == 0x0009D8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_4) == 0x000AE0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000BE8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000CF0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody_5) == 0x000E00, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody_5' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001760, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001C70, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x002180, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002690, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002BA0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody_4) == 0x0030B0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody_4' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x003A10, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody_3) == 0x003A30, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ControlRig_4) == 0x004390, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ControlRig_4' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x004810, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ControlRig_3) == 0x005170, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ControlRig_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0055E8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0056F0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x005818, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ControlRig_2) == 0x005840, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ControlRig_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x005CB8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x005D30, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x005D58, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x005D78, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x005DC0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x005DE0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x005E00, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_Constraint) == 0x005E20, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x005F28, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x005F50, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0068B0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ControlRig_1) == 0x0068F8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x006D70, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x006D90, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_ControlRig) == 0x006DB0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimGraphNode_RigidBody) == 0x007230, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, __CustomProperty_is_NOT_Moving_2d_1BBCF32C4DA60949C8640B89731068F1) == 0x007B90, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::__CustomProperty_is_NOT_Moving_2d_1BBCF32C4DA60949C8640B89731068F1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, __CustomProperty_is_NOT_Moving_2d_ED52AE82435AB34682DB20BEE48EB678) == 0x007B98, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::__CustomProperty_is_NOT_Moving_2d_ED52AE82435AB34682DB20BEE48EB678' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Gravity_Override_Params) == 0x007BA0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Gravity_Override_Params' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, GravityOverride) == 0x008358, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::GravityOverride' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, isCrouch) == 0x008370, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::isCrouch' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Delta_Time_X) == 0x008378, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Delta_Time_X' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Mesh) == 0x008380, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, dynamic_mat_instance) == 0x008388, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::dynamic_mat_instance' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, dynamic_overlay_mat) == 0x008390, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::dynamic_overlay_mat' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Previous_Velocity_Transform_Location_reg1) == 0x008398, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Previous_Velocity_Transform_Location_reg1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Previous_Velocity_Transform_Velocity_reg1) == 0x0083B0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Previous_Velocity_Transform_Velocity_reg1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Previous_Velocity_Transform_Location_reg2) == 0x0083C8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Previous_Velocity_Transform_Location_reg2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Previous_Velocity_Transform_Velocity_reg2) == 0x0083E0, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Previous_Velocity_Transform_Velocity_reg2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Velocity_Interp_Speed_reg1) == 0x0083F8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Velocity_Interp_Speed_reg1' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, wind_strength) == 0x008400, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::wind_strength' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, TurbulenceNoiseTileDivisor) == 0x008404, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::TurbulenceNoiseTileDivisor' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Velocity_Interp_Speed_reg2) == 0x008408, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Velocity_Interp_Speed_reg2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, is_NOT_Moving_2d) == 0x008410, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::is_NOT_Moving_2d' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Is_Tactiacal_Sprint_OR_Crouch_AND_Move2D) == 0x008418, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Is_Tactiacal_Sprint_OR_Crouch_AND_Move2D' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, AnimDynamics_SimSpace_Frontend) == 0x008420, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::AnimDynamics_SimSpace_Frontend' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Anim_Dynamics_Alpha_Frontend) == 0x008428, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Anim_Dynamics_Alpha_Frontend' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, Gravity_Override_Params_2) == 0x008430, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::Gravity_Override_Params_2' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_AnimBP_C, GravityOverride_2) == 0x008BE8, "Member 'UF_MED_VoidRedemption_Rebel_AnimBP_C::GravityOverride_2' has a wrong offset!");

}

