#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_VoidRedemption_Rebel_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_VoidRedemption_Rebel_FaceAcc_AnimBP.F_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C
// 0x1780 (0x1EA0 - 0x0720)
class UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0758(0x0150)(ContainsInstancedReference)
	uint8                                         Pad_8A8[0x8];                                      // 0x08A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x08B0(0x0960)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1210(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1230(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1250(0x0478)(ContainsInstancedReference)
	bool                                          __CustomProperty_RigidBody_Enabled_C7015B284561B23BDEBADE95CB9BC52A; // 0x16C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C9[0x7];                                     // 0x16C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x16D0(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride;                                   // 0x1E88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_VoidRedemption_Rebel_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C) == 0x001EA0, "Wrong size on UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000720, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000738, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000758, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x0008B0, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001210, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001230, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, AnimGraphNode_ControlRig) == 0x001250, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, __CustomProperty_RigidBody_Enabled_C7015B284561B23BDEBADE95CB9BC52A) == 0x0016C8, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::__CustomProperty_RigidBody_Enabled_C7015B284561B23BDEBADE95CB9BC52A' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, Gravity_Override_Params) == 0x0016D0, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::Gravity_Override_Params' has a wrong offset!");
static_assert(offsetof(UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C, GravityOverride) == 0x001E88, "Member 'UF_MED_VoidRedemption_Rebel_FaceAcc_AnimBP_C::GravityOverride' has a wrong offset!");

}

