#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Jiyoon_Head_UnderChin_Transform_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Jiyoon_Head_UnderChin_Transform_AnimBP.F_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C
// 0x04C0 (0x0BE0 - 0x0720)
class UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0758(0x0128)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0880(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0930(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0950(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0970(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A98(0x0128)()
	double                                        jawOpen;                                           // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Out_Names;                                         // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Jiyoon_Head_UnderChin_Transform_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C">();
	}
	static class UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C");
static_assert(sizeof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C) == 0x000BE0, "Wrong size on UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, UberGraphFrame) == 0x000720, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000728, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimBlueprintExtension_Base) == 0x000730, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_Root) == 0x000738, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000758, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000880, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000930, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000950, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000970, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000A98, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, jawOpen) == 0x000BC0, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::jawOpen' has a wrong offset!");
static_assert(offsetof(UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C, Out_Names) == 0x000BC8, "Member 'UF_MED_Jiyoon_Head_UnderChin_Transform_AnimBP_C::Out_Names' has a wrong offset!");

}

