#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Elastic_ASN_3_AnimBP_PRIME

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_Elastic_ASN_3_AnimBP_PRIME.F_MED_Elastic_ASN_3_AnimBP_PRIME_C.AnimBlueprintGeneratedConstantData
// 0x02CF (0x02D0 - 0x0001)
struct F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_31;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_32;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_33;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh_1;             // 0x00F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;               // 0x0120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                   // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody;                      // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                   // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x02A0(0x0030)()
};
static_assert(alignof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData) == 0x0002D0, "Wrong size on F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, __NameProperty_31) == 0x000004, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::__NameProperty_31' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, __NameProperty_32) == 0x000008, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::__NameProperty_32' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, __StructProperty_33) == 0x000010, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::__StructProperty_33' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000C0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh_1) == 0x0000F0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000120, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000150, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000180, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody) == 0x0001B0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x0001E0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000210, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000240, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000270, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x0002A0, "Member 'F_MED_Elastic_ASN_3_AnimBP_PRIME::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

}

