#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_VoidRedemption_Rebel_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBANParamsStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"
#include "RBANSettingStruct_structs.hpp"


namespace SDK::Params
{

// Function F_MED_VoidRedemption_Rebel_AnimBP.F_MED_VoidRedemption_Rebel_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_VoidRedemption_Rebel_AnimBP.F_MED_VoidRedemption_Rebel_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_VoidRedemption_Rebel_AnimBP.F_MED_VoidRedemption_Rebel_AnimBP_C.ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP
// 0x1988 (0x1988 - 0x0000)
struct F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBANParamsStruct                      Temp_struct_Variable;                              // 0x0008(0x0B40)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue; // 0x0B50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5D[0x3];                                      // 0x0B5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0B60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0B64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride; // 0x0B70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut; // 0x0B88(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut; // 0x0B98(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                     CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut; // 0x0C00(0x0090)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USkeletalMeshComponent*           K2Node_Event_CustomBaseMesh;                       // 0x0C90(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UCustomCharacterPart*>           K2Node_Event_CustomParts;                          // 0x0C98(0x0010)(ConstParm, ReferenceParm)
	TArray<class USkeletalMeshComponentBudgeted*> K2Node_Event_CustomMeshParts;                      // 0x0CA8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponentBudgeted*         CallFunc_Array_Get_Item;                           // 0x0CB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0CC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateDynamicOverlayMaterial_ReturnValue; // 0x0CD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0CE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0D00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0D09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0D0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D0B[0x5];                                      // 0x0D0B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBANParamsStruct                      Temp_struct_Variable_3;                            // 0x0D10(0x0B40)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x1850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1851[0x7];                                     // 0x1851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x1858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride_1; // 0x1860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut_1; // 0x1878(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut_1; // 0x1888(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                     CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut_1; // 0x18F0(0x0090)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Delta_Time_X_ImplicitCast;      // 0x1980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP) == 0x000008, "Wrong alignment on F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP");
static_assert(sizeof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP) == 0x001988, "Wrong size on F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, Temp_struct_Variable) == 0x000008, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_MakeLiteralByte_ReturnValue) == 0x000B48, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue) == 0x000B50, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000B58, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Conv_IntToByte_ReturnValue) == 0x000B5C, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, K2Node_Event_DeltaTimeX) == 0x000B60, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000B64, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000B68, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverride) == 0x000B70, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverride' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_CurrentStateOut) == 0x000B88, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_CurrentStateOut' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut) == 0x000B98, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut) == 0x000C00, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, K2Node_Event_CustomBaseMesh) == 0x000C90, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::K2Node_Event_CustomBaseMesh' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, K2Node_Event_CustomParts) == 0x000C98, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::K2Node_Event_CustomParts' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, K2Node_Event_CustomMeshParts) == 0x000CA8, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::K2Node_Event_CustomMeshParts' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Array_Get_Item) == 0x000CB8, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, Temp_struct_Variable_1) == 0x000CC0, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_GetOrCreateDynamicOverlayMaterial_ReturnValue) == 0x000CD8, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_GetOrCreateDynamicOverlayMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, Temp_struct_Variable_2) == 0x000CE0, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000CF8, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000D00, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000D08, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000D09, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000D0A, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, Temp_struct_Variable_3) == 0x000D10, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x001850, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x001858, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverride_1) == 0x001860, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverride_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_CurrentStateOut_1) == 0x001878, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_CurrentStateOut_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut_1) == 0x001888, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut_1) == 0x0018F0, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut_1' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP, K2Node_VariableSet_Delta_Time_X_ImplicitCast) == 0x001980, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_ExecuteUbergraph_F_MED_VoidRedemption_Rebel_AnimBP::K2Node_VariableSet_Delta_Time_X_ImplicitCast' has a wrong offset!");

// Function F_MED_VoidRedemption_Rebel_AnimBP.F_MED_VoidRedemption_Rebel_AnimBP_C.OnCharacterCustomizationLoaded
// 0x0028 (0x0028 - 0x0000)
struct F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded final
{
public:
	const class USkeletalMeshComponent*           CustomBaseMesh;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UCustomCharacterPart*>           CustomParts;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class USkeletalMeshComponentBudgeted*> CustomMeshParts;                                   // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded) == 0x000008, "Wrong alignment on F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded");
static_assert(sizeof(F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded) == 0x000028, "Wrong size on F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded, CustomBaseMesh) == 0x000000, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded::CustomBaseMesh' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded, CustomParts) == 0x000008, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded::CustomParts' has a wrong offset!");
static_assert(offsetof(F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded, CustomMeshParts) == 0x000018, "Member 'F_MED_VoidRedemption_Rebel_AnimBP_C_OnCharacterCustomizationLoaded::CustomMeshParts' has a wrong offset!");

}

