#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_DeformRig_Debug_Bool

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FN_DeformRig_Debug_Bool.FN_DeformRig_Debug_Bool
// 0x0004 (0x0004 - 0x0000)
struct FFN_DeformRig_Debug_Bool final
{
public:
	bool                                          upperarm_debug_18_F6E503E24E9D697DBCF95D90CEAF8FAF; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          wrist_debug_20_46346FED433024AA44D19AACFC1E7900;   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          groinGlute_debug_27_942F0C324595F0DE1B0B29B3BA2DF004; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          lat_debug_26_CA0A6A034DCFC9CF54F2179AD2785CA4;     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFN_DeformRig_Debug_Bool) == 0x000001, "Wrong alignment on FFN_DeformRig_Debug_Bool");
static_assert(sizeof(FFN_DeformRig_Debug_Bool) == 0x000004, "Wrong size on FFN_DeformRig_Debug_Bool");
static_assert(offsetof(FFN_DeformRig_Debug_Bool, upperarm_debug_18_F6E503E24E9D697DBCF95D90CEAF8FAF) == 0x000000, "Member 'FFN_DeformRig_Debug_Bool::upperarm_debug_18_F6E503E24E9D697DBCF95D90CEAF8FAF' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Debug_Bool, wrist_debug_20_46346FED433024AA44D19AACFC1E7900) == 0x000001, "Member 'FFN_DeformRig_Debug_Bool::wrist_debug_20_46346FED433024AA44D19AACFC1E7900' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Debug_Bool, groinGlute_debug_27_942F0C324595F0DE1B0B29B3BA2DF004) == 0x000002, "Member 'FFN_DeformRig_Debug_Bool::groinGlute_debug_27_942F0C324595F0DE1B0B29B3BA2DF004' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Debug_Bool, lat_debug_26_CA0A6A034DCFC9CF54F2179AD2785CA4) == 0x000003, "Member 'FFN_DeformRig_Debug_Bool::lat_debug_26_CA0A6A034DCFC9CF54F2179AD2785CA4' has a wrong offset!");

}

