#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_DeformRig_Curve_Bool

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FN_DeformRig_Curve_Bool.FN_DeformRig_Curve_Bool
// 0x0014 (0x0014 - 0x0000)
struct FFN_DeformRig_Curve_Bool final
{
public:
	bool                                          deformRig_l_upperarm_up_alpha_72_2CAF6F704301A4671056E8AF8B9C6959; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_upperarm_up_alpha_73_7435B411475DE10CCB23A083A074F67C; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_upperarm_fr_alpha_74_E7712D2544FB07FFECBF8CAFD592AEF3; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_upperarm_fr_alpha_75_CB51B80C4410C4042DE1F9A613F85415; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_upperarm_bk_alpha_76_C8D9D8CE409FF3458EBC6F81A6C1C9B1; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_upperarm_bk_alpha_77_E218510D4AAFCCA8B63011B13E341B14; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_wrist_up_alpha_78_AB3D343041F489B2FE9366BA9AE642F3; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_wrist_up_alpha_79_AD4188394D048A71351248A8EE8FA48A; // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_wrist_dn_alpha_80_2AD9256440407A5B32B083A348721E11; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_wrist_dn_alpha_81_BD26EBE44B7EB9F1A0E3CD82802439A1; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_knee_alpha_82_CE3A671D44B8099FC4DF37B0369C4DE1; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_knee_alpha_83_B422A70644FD658D95897C82B70F5497; // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_pec_alpha_84_26180F3746E35F7782F41A864E5D4FD8; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_pec_alpha_85_4F96B0B84D1D68DAB542338CBACB6A15; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_elbow_alpha_86_7885549B4283A46D80C2A4A71D9684FC; // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_elbow_alpha_87_186DD30A4516E700BB2FCC93A0AFCEDA; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_thigh_up_alpha_88_34706BB443F3D30ACFCFEBA256B99473; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_thigh_up_alpha_89_A392AF7746CC1DFE0AE9B6A47647763D; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_l_lat_alpha_91_839C57B749E9485DBF5347BC21669649; // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          deformRig_r_lat_alpha_93_892F62234C8701C5455CF4BF5A7C4215; // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFN_DeformRig_Curve_Bool) == 0x000001, "Wrong alignment on FFN_DeformRig_Curve_Bool");
static_assert(sizeof(FFN_DeformRig_Curve_Bool) == 0x000014, "Wrong size on FFN_DeformRig_Curve_Bool");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_upperarm_up_alpha_72_2CAF6F704301A4671056E8AF8B9C6959) == 0x000000, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_upperarm_up_alpha_72_2CAF6F704301A4671056E8AF8B9C6959' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_upperarm_up_alpha_73_7435B411475DE10CCB23A083A074F67C) == 0x000001, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_upperarm_up_alpha_73_7435B411475DE10CCB23A083A074F67C' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_upperarm_fr_alpha_74_E7712D2544FB07FFECBF8CAFD592AEF3) == 0x000002, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_upperarm_fr_alpha_74_E7712D2544FB07FFECBF8CAFD592AEF3' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_upperarm_fr_alpha_75_CB51B80C4410C4042DE1F9A613F85415) == 0x000003, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_upperarm_fr_alpha_75_CB51B80C4410C4042DE1F9A613F85415' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_upperarm_bk_alpha_76_C8D9D8CE409FF3458EBC6F81A6C1C9B1) == 0x000004, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_upperarm_bk_alpha_76_C8D9D8CE409FF3458EBC6F81A6C1C9B1' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_upperarm_bk_alpha_77_E218510D4AAFCCA8B63011B13E341B14) == 0x000005, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_upperarm_bk_alpha_77_E218510D4AAFCCA8B63011B13E341B14' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_wrist_up_alpha_78_AB3D343041F489B2FE9366BA9AE642F3) == 0x000006, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_wrist_up_alpha_78_AB3D343041F489B2FE9366BA9AE642F3' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_wrist_up_alpha_79_AD4188394D048A71351248A8EE8FA48A) == 0x000007, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_wrist_up_alpha_79_AD4188394D048A71351248A8EE8FA48A' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_wrist_dn_alpha_80_2AD9256440407A5B32B083A348721E11) == 0x000008, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_wrist_dn_alpha_80_2AD9256440407A5B32B083A348721E11' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_wrist_dn_alpha_81_BD26EBE44B7EB9F1A0E3CD82802439A1) == 0x000009, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_wrist_dn_alpha_81_BD26EBE44B7EB9F1A0E3CD82802439A1' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_knee_alpha_82_CE3A671D44B8099FC4DF37B0369C4DE1) == 0x00000A, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_knee_alpha_82_CE3A671D44B8099FC4DF37B0369C4DE1' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_knee_alpha_83_B422A70644FD658D95897C82B70F5497) == 0x00000B, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_knee_alpha_83_B422A70644FD658D95897C82B70F5497' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_pec_alpha_84_26180F3746E35F7782F41A864E5D4FD8) == 0x00000C, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_pec_alpha_84_26180F3746E35F7782F41A864E5D4FD8' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_pec_alpha_85_4F96B0B84D1D68DAB542338CBACB6A15) == 0x00000D, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_pec_alpha_85_4F96B0B84D1D68DAB542338CBACB6A15' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_elbow_alpha_86_7885549B4283A46D80C2A4A71D9684FC) == 0x00000E, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_elbow_alpha_86_7885549B4283A46D80C2A4A71D9684FC' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_elbow_alpha_87_186DD30A4516E700BB2FCC93A0AFCEDA) == 0x00000F, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_elbow_alpha_87_186DD30A4516E700BB2FCC93A0AFCEDA' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_thigh_up_alpha_88_34706BB443F3D30ACFCFEBA256B99473) == 0x000010, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_thigh_up_alpha_88_34706BB443F3D30ACFCFEBA256B99473' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_thigh_up_alpha_89_A392AF7746CC1DFE0AE9B6A47647763D) == 0x000011, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_thigh_up_alpha_89_A392AF7746CC1DFE0AE9B6A47647763D' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_l_lat_alpha_91_839C57B749E9485DBF5347BC21669649) == 0x000012, "Member 'FFN_DeformRig_Curve_Bool::deformRig_l_lat_alpha_91_839C57B749E9485DBF5347BC21669649' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Curve_Bool, deformRig_r_lat_alpha_93_892F62234C8701C5455CF4BF5A7C4215) == 0x000013, "Member 'FFN_DeformRig_Curve_Bool::deformRig_r_lat_alpha_93_892F62234C8701C5455CF4BF5A7C4215' has a wrong offset!");

}

