#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NNE

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class NNE.NNEModelData
// 0x0090 (0x00B8 - 0x0028)
class UNNEModelData final : public UObject
{
public:
	uint8                                         Pad_28[0x90];                                      // 0x0028(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEModelData">();
	}
	static class UNNEModelData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEModelData>();
	}
};
static_assert(alignof(UNNEModelData) == 0x000008, "Wrong alignment on UNNEModelData");
static_assert(sizeof(UNNEModelData) == 0x0000B8, "Wrong size on UNNEModelData");

// Class NNE.NNERuntime
// 0x0000 (0x0000 - 0x0000)
class INNERuntime final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntime">();
	}
	static class INNERuntime* GetDefaultObj()
	{
		return GetDefaultObjImpl<INNERuntime>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(INNERuntime) == 0x000001, "Wrong alignment on INNERuntime");
static_assert(sizeof(INNERuntime) == 0x000001, "Wrong size on INNERuntime");

// Class NNE.NNERuntimeCPU
// 0x0000 (0x0000 - 0x0000)
class INNERuntimeCPU final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeCPU">();
	}
	static class INNERuntimeCPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<INNERuntimeCPU>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(INNERuntimeCPU) == 0x000001, "Wrong alignment on INNERuntimeCPU");
static_assert(sizeof(INNERuntimeCPU) == 0x000001, "Wrong size on INNERuntimeCPU");

// Class NNE.NNERuntimeGPU
// 0x0000 (0x0000 - 0x0000)
class INNERuntimeGPU final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeGPU">();
	}
	static class INNERuntimeGPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<INNERuntimeGPU>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(INNERuntimeGPU) == 0x000001, "Wrong alignment on INNERuntimeGPU");
static_assert(sizeof(INNERuntimeGPU) == 0x000001, "Wrong size on INNERuntimeGPU");

// Class NNE.NNERuntimeRDG
// 0x0000 (0x0000 - 0x0000)
class INNERuntimeRDG final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNERuntimeRDG">();
	}
	static class INNERuntimeRDG* GetDefaultObj()
	{
		return GetDefaultObjImpl<INNERuntimeRDG>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(INNERuntimeRDG) == 0x000001, "Wrong alignment on INNERuntimeRDG");
static_assert(sizeof(INNERuntimeRDG) == 0x000001, "Wrong size on INNERuntimeRDG");

}

