#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "FN_DeformRig_Part_Value_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FN_DeformRig_Part_Bool_structs.hpp"
#include "FN_DeformRig_Curve_Bool_structs.hpp"
#include "FN_DeformRig_Debug_Bool_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_93b3e3f215d0c6af
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_93b3e3f215d0c6af final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_93b3e3f215d0c6af) == 0x000004, "Wrong alignment on FPropertyBag_93b3e3f215d0c6af");
static_assert(sizeof(FPropertyBag_93b3e3f215d0c6af) == 0x000004, "Wrong size on FPropertyBag_93b3e3f215d0c6af");
static_assert(offsetof(FPropertyBag_93b3e3f215d0c6af, Size) == 0x000000, "Member 'FPropertyBag_93b3e3f215d0c6af::Size' has a wrong offset!");

// PropertyBag Transient.PropertyBag_893cc044b9ad8ac0
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_893cc044b9ad8ac0 final
{
public:
	class USoundBase*                             ShopIntroWhooshSound;                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ContentWhoosh_RetractSound;                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_893cc044b9ad8ac0) == 0x000008, "Wrong alignment on FPropertyBag_893cc044b9ad8ac0");
static_assert(sizeof(FPropertyBag_893cc044b9ad8ac0) == 0x000010, "Wrong size on FPropertyBag_893cc044b9ad8ac0");
static_assert(offsetof(FPropertyBag_893cc044b9ad8ac0, ShopIntroWhooshSound) == 0x000000, "Member 'FPropertyBag_893cc044b9ad8ac0::ShopIntroWhooshSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_893cc044b9ad8ac0, ContentWhoosh_RetractSound) == 0x000008, "Member 'FPropertyBag_893cc044b9ad8ac0::ContentWhoosh_RetractSound' has a wrong offset!");

// PropertyBag Transient.PropertyBag_862508c04c749853
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_862508c04c749853 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FPropertyBag_862508c04c749853) == 0x000004, "Wrong alignment on FPropertyBag_862508c04c749853");
static_assert(sizeof(FPropertyBag_862508c04c749853) == 0x000010, "Wrong size on FPropertyBag_862508c04c749853");
static_assert(offsetof(FPropertyBag_862508c04c749853, Margin) == 0x000000, "Member 'FPropertyBag_862508c04c749853::Margin' has a wrong offset!");

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
static_assert(alignof(FPropertyBag_0) == 0x000001, "Wrong alignment on FPropertyBag_0");
static_assert(sizeof(FPropertyBag_0) == 0x000001, "Wrong size on FPropertyBag_0");

// PropertyBag Transient.PropertyBag_ea3ed5dbc838f480
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_ea3ed5dbc838f480 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_ea3ed5dbc838f480) == 0x000008, "Wrong alignment on FPropertyBag_ea3ed5dbc838f480");
static_assert(sizeof(FPropertyBag_ea3ed5dbc838f480) == 0x000018, "Wrong size on FPropertyBag_ea3ed5dbc838f480");
static_assert(offsetof(FPropertyBag_ea3ed5dbc838f480, FontObject) == 0x000000, "Member 'FPropertyBag_ea3ed5dbc838f480::FontObject' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ea3ed5dbc838f480, TypefaceFontName) == 0x000008, "Member 'FPropertyBag_ea3ed5dbc838f480::TypefaceFontName' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ea3ed5dbc838f480, Size) == 0x00000C, "Member 'FPropertyBag_ea3ed5dbc838f480::Size' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ea3ed5dbc838f480, LetterSpacing) == 0x000010, "Member 'FPropertyBag_ea3ed5dbc838f480::LetterSpacing' has a wrong offset!");
static_assert(offsetof(FPropertyBag_ea3ed5dbc838f480, SkewAmount) == 0x000014, "Member 'FPropertyBag_ea3ed5dbc838f480::SkewAmount' has a wrong offset!");

// PropertyBag Transient.PropertyBag_73c83f300aa939fa
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_73c83f300aa939fa final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_73c83f300aa939fa) == 0x000004, "Wrong alignment on FPropertyBag_73c83f300aa939fa");
static_assert(sizeof(FPropertyBag_73c83f300aa939fa) == 0x000004, "Wrong size on FPropertyBag_73c83f300aa939fa");
static_assert(offsetof(FPropertyBag_73c83f300aa939fa, LineHeightPercentage) == 0x000000, "Member 'FPropertyBag_73c83f300aa939fa::LineHeightPercentage' has a wrong offset!");

// PropertyBag Transient.PropertyBag_3ee0926f05d53cdc
// 0x0078 (0x0078 - 0x0000)
struct FPropertyBag_3ee0926f05d53cdc final
{
public:
	class UObject*                                FontMaterial;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_0;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BorderMaterial;                                    // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         GamepadPromptFont;                                 // 0x0020(0x0058)(Edit, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_3ee0926f05d53cdc) == 0x000008, "Wrong alignment on FPropertyBag_3ee0926f05d53cdc");
static_assert(sizeof(FPropertyBag_3ee0926f05d53cdc) == 0x000078, "Wrong size on FPropertyBag_3ee0926f05d53cdc");
static_assert(offsetof(FPropertyBag_3ee0926f05d53cdc, FontMaterial) == 0x000000, "Member 'FPropertyBag_3ee0926f05d53cdc::FontMaterial' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3ee0926f05d53cdc, FontMaterial_0) == 0x000008, "Member 'FPropertyBag_3ee0926f05d53cdc::FontMaterial_0' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3ee0926f05d53cdc, BackgroundMaterial) == 0x000010, "Member 'FPropertyBag_3ee0926f05d53cdc::BackgroundMaterial' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3ee0926f05d53cdc, BorderMaterial) == 0x000018, "Member 'FPropertyBag_3ee0926f05d53cdc::BorderMaterial' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3ee0926f05d53cdc, GamepadPromptFont) == 0x000020, "Member 'FPropertyBag_3ee0926f05d53cdc::GamepadPromptFont' has a wrong offset!");

// PropertyBag Transient.PropertyBag_2da65f97288b49de
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_2da65f97288b49de final
{
public:
	class USoundBase*                             HoveredSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_2da65f97288b49de) == 0x000008, "Wrong alignment on FPropertyBag_2da65f97288b49de");
static_assert(sizeof(FPropertyBag_2da65f97288b49de) == 0x000030, "Wrong size on FPropertyBag_2da65f97288b49de");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, HoveredSound) == 0x000000, "Member 'FPropertyBag_2da65f97288b49de::HoveredSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, PressedSound) == 0x000008, "Member 'FPropertyBag_2da65f97288b49de::PressedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, HoldPressedSound) == 0x000010, "Member 'FPropertyBag_2da65f97288b49de::HoldPressedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, HoldSound) == 0x000018, "Member 'FPropertyBag_2da65f97288b49de::HoldSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, HoldReleasedSound) == 0x000020, "Member 'FPropertyBag_2da65f97288b49de::HoldReleasedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_2da65f97288b49de, HoldCompletedSound) == 0x000028, "Member 'FPropertyBag_2da65f97288b49de::HoldCompletedSound' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, Position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::Position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_c4d6a66cf1dc9fa4
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_c4d6a66cf1dc9fa4 final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_c4d6a66cf1dc9fa4) == 0x000004, "Wrong alignment on FPropertyBag_c4d6a66cf1dc9fa4");
static_assert(sizeof(FPropertyBag_c4d6a66cf1dc9fa4) == 0x000008, "Wrong size on FPropertyBag_c4d6a66cf1dc9fa4");
static_assert(offsetof(FPropertyBag_c4d6a66cf1dc9fa4, LineHeightPercentage) == 0x000000, "Member 'FPropertyBag_c4d6a66cf1dc9fa4::LineHeightPercentage' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c4d6a66cf1dc9fa4, Size) == 0x000004, "Member 'FPropertyBag_c4d6a66cf1dc9fa4::Size' has a wrong offset!");

// PropertyBag Transient.PropertyBag_84bacd3dd173eaf4
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_84bacd3dd173eaf4 final
{
public:
	class USoundBase*                             HoveredSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_84bacd3dd173eaf4) == 0x000008, "Wrong alignment on FPropertyBag_84bacd3dd173eaf4");
static_assert(sizeof(FPropertyBag_84bacd3dd173eaf4) == 0x000030, "Wrong size on FPropertyBag_84bacd3dd173eaf4");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, HoveredSound) == 0x000000, "Member 'FPropertyBag_84bacd3dd173eaf4::HoveredSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, PressedSound) == 0x000008, "Member 'FPropertyBag_84bacd3dd173eaf4::PressedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, HoldPressedSound) == 0x000010, "Member 'FPropertyBag_84bacd3dd173eaf4::HoldPressedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, HoldSound) == 0x000018, "Member 'FPropertyBag_84bacd3dd173eaf4::HoldSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, HoldReleasedSound) == 0x000020, "Member 'FPropertyBag_84bacd3dd173eaf4::HoldReleasedSound' has a wrong offset!");
static_assert(offsetof(FPropertyBag_84bacd3dd173eaf4, HoldCompletedSound) == 0x000028, "Member 'FPropertyBag_84bacd3dd173eaf4::HoldCompletedSound' has a wrong offset!");

// PropertyBag Transient.PropertyBag_16760b1878cd5980
// 0x0014 (0x0014 - 0x0000)
struct FPropertyBag_16760b1878cd5980 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LineHeightPercentage;                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_16760b1878cd5980) == 0x000004, "Wrong alignment on FPropertyBag_16760b1878cd5980");
static_assert(sizeof(FPropertyBag_16760b1878cd5980) == 0x000014, "Wrong size on FPropertyBag_16760b1878cd5980");
static_assert(offsetof(FPropertyBag_16760b1878cd5980, Margin) == 0x000000, "Member 'FPropertyBag_16760b1878cd5980::Margin' has a wrong offset!");
static_assert(offsetof(FPropertyBag_16760b1878cd5980, LineHeightPercentage) == 0x000010, "Member 'FPropertyBag_16760b1878cd5980::LineHeightPercentage' has a wrong offset!");

// PropertyBag Transient.PropertyBag_bcd7715f569f6557
// 0x0300 (0x0300 - 0x0000)
struct FPropertyBag_bcd7715f569f6557 final
{
public:
	float                                         RigVMModel___SphericalPoseReader_OutputParam;      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               RigVMModel___SphericalPoseReader_InnerRegion;      // 0x0008(0x0010)(Edit)
	TArray<struct FSphericalRegion>               RigVMModel___SphericalPoseReader_OuterRegion;      // 0x0018(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_DriverNormal;     // 0x0028(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_Driver2D;         // 0x0038(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___SphericalPoseReader_DriverCache;      // 0x0048(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___SphericalPoseReader_OptionalParentCache; // 0x0058(0x0010)(Edit)
	TArray<struct FTransform>                     RigVMModel___SphericalPoseReader_LocalDriverTransformInit; // 0x0068(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_CachedRotationOffset; // 0x0078(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___SphericalPoseReader_bCachedInitTransforms; // 0x0088(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedChild; // 0x0098(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedParent; // 0x00A8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedChild; // 0x00B8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedParent; // 0x00C8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedChild; // 0x00D8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedParent; // 0x00E8(0x0010)(Edit)
	double                                        RigVMModel___Remap_Result;                         // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToEuler_Result; // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform; // 0x0120(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild; // 0x0180(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent; // 0x0190(0x0010)(Edit)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionToEuler_Value; // 0x01A0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Remap_Value;                          // 0x01C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_Weight; // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedChild; // 0x01D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedParent; // 0x01E0(0x0010)(Edit)
	float                                         RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_Weight; // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedChild; // 0x01F8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedParent; // 0x0208(0x0010)(Edit)
	float                                         RigVMModel___SphericalPoseReader_1_OutputParam;    // 0x0218(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               RigVMModel___SphericalPoseReader_1_InnerRegion;    // 0x0220(0x0010)(Edit)
	TArray<struct FSphericalRegion>               RigVMModel___SphericalPoseReader_1_OuterRegion;    // 0x0230(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_1_DriverNormal;   // 0x0240(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_1_Driver2D;       // 0x0250(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___SphericalPoseReader_1_DriverCache;    // 0x0260(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___SphericalPoseReader_1_OptionalParentCache; // 0x0270(0x0010)(Edit)
	TArray<struct FTransform>                     RigVMModel___SphericalPoseReader_1_LocalDriverTransformInit; // 0x0280(0x0010)(Edit)
	TArray<struct FVector>                        RigVMModel___SphericalPoseReader_1_CachedRotationOffset; // 0x0290(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___SphericalPoseReader_1_bCachedInitTransforms; // 0x02A0(0x0010)(Edit)
	float                                         RigVMModel___KalmanFilter_Result;                  // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TArray<float>>                         RigVMModel___KalmanFilter_Buffer;                  // 0x02B8(0x0010)(Edit)
	TArray<int32>                                 RigVMModel___KalmanFilter_LastInsertIndex;         // 0x02C8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedChild; // 0x02D8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedParent; // 0x02E8(0x0010)(Edit)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x02F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_bcd7715f569f6557) == 0x000010, "Wrong alignment on FPropertyBag_bcd7715f569f6557");
static_assert(sizeof(FPropertyBag_bcd7715f569f6557) == 0x000300, "Wrong size on FPropertyBag_bcd7715f569f6557");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_OutputParam) == 0x000000, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_OutputParam' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_InnerRegion) == 0x000008, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_InnerRegion' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_OuterRegion) == 0x000018, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_OuterRegion' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_DriverNormal) == 0x000028, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_DriverNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_Driver2D) == 0x000038, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_Driver2D' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_DriverCache) == 0x000048, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_DriverCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_OptionalParentCache) == 0x000058, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_OptionalParentCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_LocalDriverTransformInit) == 0x000068, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_LocalDriverTransformInit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_CachedRotationOffset) == 0x000078, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_CachedRotationOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_bCachedInitTransforms) == 0x000088, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_bCachedInitTransforms' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedChild) == 0x000098, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedParent) == 0x0000A8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedChild) == 0x0000B8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedParent) == 0x0000C8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_1_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedChild) == 0x0000D8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedParent) == 0x0000E8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___Remap_Result) == 0x0000F8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___Remap_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigVMFunction_MathQuaternionToEuler_Result) == 0x000100, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigVMFunction_MathQuaternionToEuler_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform) == 0x000120, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild) == 0x000180, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent) == 0x000190, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigVMFunction_MathQuaternionToEuler_Value) == 0x0001A0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigVMFunction_MathQuaternionToEuler_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___Remap_Value) == 0x0001C0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___Remap_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_Weight) == 0x0001C8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_Weight' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedChild) == 0x0001D0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedParent) == 0x0001E0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_Weight) == 0x0001F0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_Weight' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedChild) == 0x0001F8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedParent) == 0x000208, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_2_1_1_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_OutputParam) == 0x000218, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_OutputParam' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_InnerRegion) == 0x000220, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_InnerRegion' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_OuterRegion) == 0x000230, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_OuterRegion' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_DriverNormal) == 0x000240, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_DriverNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_Driver2D) == 0x000250, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_Driver2D' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_DriverCache) == 0x000260, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_DriverCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_OptionalParentCache) == 0x000270, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_OptionalParentCache' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_LocalDriverTransformInit) == 0x000280, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_LocalDriverTransformInit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_CachedRotationOffset) == 0x000290, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_CachedRotationOffset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___SphericalPoseReader_1_bCachedInitTransforms) == 0x0002A0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___SphericalPoseReader_1_bCachedInitTransforms' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___KalmanFilter_Result) == 0x0002B0, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___KalmanFilter_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___KalmanFilter_Buffer) == 0x0002B8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___KalmanFilter_Buffer' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___KalmanFilter_LastInsertIndex) == 0x0002C8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___KalmanFilter_LastInsertIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedChild) == 0x0002D8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedChild' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedParent) == 0x0002E8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigUnit_SetRelativeTransformForItem_3_2_1_3_CachedParent' has a wrong offset!");
static_assert(offsetof(FPropertyBag_bcd7715f569f6557, RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun) == 0x0002F8, "Member 'FPropertyBag_bcd7715f569f6557::RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun' has a wrong offset!");

// PropertyBag Transient.PropertyBag_82c781121f843240
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_82c781121f843240 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FPropertyBag_82c781121f843240) == 0x000004, "Wrong alignment on FPropertyBag_82c781121f843240");
static_assert(sizeof(FPropertyBag_82c781121f843240) == 0x000010, "Wrong size on FPropertyBag_82c781121f843240");
static_assert(offsetof(FPropertyBag_82c781121f843240, Margin) == 0x000000, "Member 'FPropertyBag_82c781121f843240::Margin' has a wrong offset!");

// PropertyBag Transient.PropertyBag_3d00afb443074af3
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_3d00afb443074af3 final
{
public:
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0000(0x0018)(Edit, NoDestructor)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0018(0x0018)(Edit, NoDestructor)
};
static_assert(alignof(FPropertyBag_3d00afb443074af3) == 0x000008, "Wrong alignment on FPropertyBag_3d00afb443074af3");
static_assert(sizeof(FPropertyBag_3d00afb443074af3) == 0x000030, "Wrong size on FPropertyBag_3d00afb443074af3");
static_assert(offsetof(FPropertyBag_3d00afb443074af3, PressedSlateSoundOverride) == 0x000000, "Member 'FPropertyBag_3d00afb443074af3::PressedSlateSoundOverride' has a wrong offset!");
static_assert(offsetof(FPropertyBag_3d00afb443074af3, HoveredSlateSoundOverride) == 0x000018, "Member 'FPropertyBag_3d00afb443074af3::HoveredSlateSoundOverride' has a wrong offset!");

// PropertyBag Transient.PropertyBag_33b02f63ffe8021d
// 0x56B0 (0x56B0 - 0x0000)
struct FPropertyBag_33b02f63ffe8021d final
{
public:
	struct FFN_DeformRig_Part_Bool                LocalVariable__FN_DeformRig_FNC_deform_bool_struct; // 0x0000(0x0009)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFN_DeformRig_Part_Value               LocalVariable__FN_DeformRig_FNC_deform_value_struct; // 0x0010(0x05A0)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFN_DeformRig_Curve_Bool               LocalVariable__FN_DeformRig_FNC_deform_curve_struct; // 0x05B0(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFN_DeformRig_Debug_Bool               LocalVariable__FN_DeformRig_FNC_deform_debug_struct; // 0x05C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FN_DeformRig_FNC___FN_DeformRig_FNC_Branch_9_1_1_Condition; // 0x05C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FN_DeformRig_FNC___FN_DeformRig_FNC_DeformRig_UpperArm_FNC_debug; // 0x05C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CA[0x6];                                      // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFN_DeformRig_Part_Value               LocalVariable__DeformRig_UpperArm_FNC_value_struct_var; // 0x05D0(0x05A0)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFN_DeformRig_Curve_Bool               LocalVariable__DeformRig_UpperArm_FNC_curve_struct_var; // 0x0B70(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_ChildCache; // 0x0B88(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_ParentCaches; // 0x0B98(0x0010)(Edit)
	float                                         DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_OutputParam; // 0x0BA8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSphericalPoseReaderDebugSettings      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_Debug__IO; // 0x0BAC(0x0010)(Edit, NoDestructor)
	uint8                                         Pad_BBC[0x4];                                      // 0x0BBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_InnerRegion; // 0x0BC0(0x0010)(Edit)
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_OuterRegion; // 0x0BD0(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_DriverNormal; // 0x0BE0(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_Driver2D; // 0x0BF0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_DriverCache; // 0x0C00(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_OptionalParentCache; // 0x0C10(0x0010)(Edit)
	TArray<struct FTransform>                     DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_LocalDriverTransformInit; // 0x0C20(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_CachedRotationOffset; // 0x0C30(0x0010)(Edit)
	TArray<bool>                                  DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_bCachedInitTransforms; // 0x0C40(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_ItemToModify__IO; // 0x0C50(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_WorkData; // 0x0C60(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_Condition; // 0x0C70(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x7];                                      // 0x0C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_CachedBoneName; // 0x0C78(0x0010)(Edit)
	TArray<int32>                                 DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_CachedBoneIndex; // 0x0C88(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_Success; // 0x0C98(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C99[0x3];                                      // 0x0C99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0C9C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_2_ChildCache; // 0x0CA0(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_2_ParentCaches; // 0x0CB0(0x0010)(Edit)
	float                                         DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_OutputParam; // 0x0CC0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSphericalPoseReaderDebugSettings      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_Debug__IO; // 0x0CC4(0x0010)(Edit, NoDestructor)
	uint8                                         Pad_CD4[0x4];                                      // 0x0CD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_InnerRegion; // 0x0CD8(0x0010)(Edit)
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_OuterRegion; // 0x0CE8(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_DriverNormal; // 0x0CF8(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_Driver2D; // 0x0D08(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_DriverCache; // 0x0D18(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_OptionalParentCache; // 0x0D28(0x0010)(Edit)
	TArray<struct FTransform>                     DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_LocalDriverTransformInit; // 0x0D38(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_CachedRotationOffset; // 0x0D48(0x0010)(Edit)
	TArray<bool>                                  DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_2_bCachedInitTransforms; // 0x0D58(0x0010)(Edit)
	uint8                                         Pad_D68[0x8];                                      // 0x0D68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_transform; // 0x0D70(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_mirrorTransform; // 0x0DD0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  DeformRig_GetMirrorTransform_FNC___DeformRig_GetMirrorTransform_FNC_MathQuaternionFromRotator_Result; // 0x0E30(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEulerTransform                        DeformRig_GetMirrorTransform_FNC___DeformRig_GetMirrorTransform_FNC_MathTransformToEulerTransform_Result; // 0x0E50(0x0048)(Edit, NoDestructor)
	struct FRotator                               DeformRig_GetMirrorTransform_FNC___DeformRig_GetMirrorTransform_FNC_MathQuaternionFromRotator_Value; // 0x0E98(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                DeformRig_GetMirrorTransform_FNC___DeformRig_GetMirrorTransform_FNC_MathVectorScale_Result; // 0x0EB0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeformRig_GetMirrorTransform_FNC___DeformRig_GetMirrorTransform_FNC_MathVectorScale_Value; // 0x0EC8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_2_ItemToModify__IO; // 0x0EE0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_2_WorkData; // 0x0EF0(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_1_Condition; // 0x0F00(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F01[0x7];                                      // 0x0F01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_1_CachedBoneName; // 0x0F08(0x0010)(Edit)
	TArray<int32>                                 DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_1_CachedBoneIndex; // 0x0F18(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_1_Success; // 0x0F28(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F29[0x3];                                      // 0x0F29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0F2C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_1_ChildCache; // 0x0F30(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_1_ParentCaches; // 0x0F40(0x0010)(Edit)
	float                                         DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_OutputParam; // 0x0F50(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSphericalPoseReaderDebugSettings      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_Debug__IO; // 0x0F54(0x0010)(Edit, NoDestructor)
	uint8                                         Pad_F64[0x4];                                      // 0x0F64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_InnerRegion; // 0x0F68(0x0010)(Edit)
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_OuterRegion; // 0x0F78(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_DriverNormal; // 0x0F88(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_Driver2D; // 0x0F98(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_DriverCache; // 0x0FA8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_OptionalParentCache; // 0x0FB8(0x0010)(Edit)
	TArray<struct FTransform>                     DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_LocalDriverTransformInit; // 0x0FC8(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_CachedRotationOffset; // 0x0FD8(0x0010)(Edit)
	TArray<bool>                                  DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_bCachedInitTransforms; // 0x0FE8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_ItemToModify__IO; // 0x0FF8(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_WorkData; // 0x1008(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_1_ItemToModify__IO; // 0x1018(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_1_WorkData; // 0x1028(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_2_Condition; // 0x1038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1039[0x7];                                     // 0x1039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_2_CachedBoneName; // 0x1040(0x0010)(Edit)
	TArray<int32>                                 DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_2_CachedBoneIndex; // 0x1050(0x0010)(Edit)
	bool                                          DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DISPATCH_RigDispatch_SetAnimAttribute_1_1_2_Success; // 0x1060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1061[0x3];                                     // 0x1061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x1064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_1_2_ChildCache; // 0x1068(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ParentConstraint_3_1_2_ParentCaches; // 0x1078(0x0010)(Edit)
	float                                         DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_OutputParam; // 0x1088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSphericalPoseReaderDebugSettings      DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_Debug__IO; // 0x108C(0x0010)(Edit, NoDestructor)
	uint8                                         Pad_109C[0x4];                                     // 0x109C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_InnerRegion; // 0x10A0(0x0010)(Edit)
	TArray<struct FSphericalRegion>               DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_OuterRegion; // 0x10B0(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_DriverNormal; // 0x10C0(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_Driver2D; // 0x10D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_DriverCache; // 0x10E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_OptionalParentCache; // 0x10F0(0x0010)(Edit)
	TArray<struct FTransform>                     DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_LocalDriverTransformInit; // 0x1100(0x0010)(Edit)
	TArray<struct FVector>                        DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_CachedRotationOffset; // 0x1110(0x0010)(Edit)
	TArray<bool>                                  DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_SphericalPoseReader_1_2_bCachedInitTransforms; // 0x1120(0x0010)(Edit)
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_2_transform; // 0x1130(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_2_mirrorTransform; // 0x1190(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  DeformRig_GetMirrorTransform_FNC_2___DeformRig_GetMirrorTransform_FNC_MathQuaternionFromRotator_Result; // 0x11F0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEulerTransform                        DeformRig_GetMirrorTransform_FNC_2___DeformRig_GetMirrorTransform_FNC_MathTransformToEulerTransform_Result; // 0x1210(0x0048)(Edit, NoDestructor)
	struct FRotator                               DeformRig_GetMirrorTransform_FNC_2___DeformRig_GetMirrorTransform_FNC_MathQuaternionFromRotator_Value; // 0x1258(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                DeformRig_GetMirrorTransform_FNC_2___DeformRig_GetMirrorTransform_FNC_MathVectorScale_Result; // 0x1270(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeformRig_GetMirrorTransform_FNC_2___DeformRig_GetMirrorTransform_FNC_MathVectorScale_Value; // 0x1288(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_3_ItemToModify__IO; // 0x12A0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_ModifyTransforms_1_3_WorkData; // 0x12B0(0x0010)(Edit)
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_1_transform; // 0x12C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DeformRig_UpperArm_FNC___DeformRig_UpperArm_FNC_DeformRig_GetMirrorTransform_FNC_1_mirrorTransform; // 0x1320(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  DeformRig_GetMirrorTransform_FNC_1___DeformRig_GetMirrorTransform_FNC_MathQuaternionFromRotator_Result; // 0x1380(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
