#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IslandTile_Minimal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IslandTile_Minimal.WBP_IslandTile_Minimal_C
// 0x00D0 (0x17E0 - 0x1710)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_IslandTile_Minimal_C : public UFortActivityTileDetailsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortActivityViewModel*                 FortActivityViewModel;                             // 0x1718(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnHoverUnhoverRehover;                        // 0x1720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnLoadedImage;                                // 0x1728(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ByEpicLogo;                                        // 0x1730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CMS_CreatorLogo;                                   // 0x1738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ErrorIcon;                                         // 0x1740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_AddSqueegeeWhenNoCCU;                // 0x1748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             LockSlot;                                          // 0x1750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NestedSlot_OutsideContent;                         // 0x1758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AddSqueegeeWhenCCU;                        // 0x1760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Lock;                                 // 0x1768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_Tag;                                  // 0x1770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator_Favorite;                          // 0x1778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_Logo;                                     // 0x1780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_SqueegeeLockOrFavorite;                   // 0x1788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_STWLockOrHighlight;                       // 0x1790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TileThumbnail;                                     // 0x1798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Discover_Tile_Base_C*              WBP_Discover_Tile_Base;                            // 0x17A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Badge_C*                     WBP_UIKit_Badge;                                   // 0x17A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Highlight_C*                 WBP_UIKit_Highlight;                               // 0x17B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   TextureParam;                                      // 0x17B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ThumbnailDisabledOverlay;                          // 0x17BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOldDiscoverCode;                                 // 0x17C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullTile;                                        // 0x17C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableCornerInfo;                                 // 0x17C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTileInCreatorPage;                               // 0x17C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RecommendModalName;                                // 0x17C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecommendedModal;                                // 0x17C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C9[0x3];                                     // 0x17C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ContextMenuFavoriteName;                           // 0x17CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowTileClicks;                                   // 0x17D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void OnTileSelectionActive();
	void OnTileSelectionNotActive();
	void PreConstruct(bool IsDesignTime);
	void SetIslandName(const class FText& IslandName);
	void ExecuteUbergraph_WBP_IslandTile_Minimal(int32 EntryPoint);
	void SetFortActivityViewModel(class UFortActivityViewModel* ViewModel);
	struct FEventReply BP_OnHoldTriggered(ECommonInputType CurrentInputType);
	void SetPanelType(EFortCreativeDiscoveryPanelType PanelTypeEnum);
	void SetColumnSize(int32 NewSize);
	void SetIsPreviewTile(bool IsPreviewTile);
	void Update_Texture_Margin_To_Resolution(class UMaterialInstanceDynamic* MaterialInstance);
	void SetHighlightText(const class FText& Text);
	void SetIconPaddingForLockOrFavorite();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSetInvalidActivityReason(EFortInvalidActivityReason InvalidActivityReason);
	void SetIsTileEnabled();
	void SetIsCurrentActivity(bool IsCurrentActivity);
	void SetCornerRadius(const struct FLinearColor& CornerRadius);
	void SetDisabledThumbnailOverlay();
	void SetupSqueegeeWidgets(class UFortActivityViewModel* ActivityVM);
	void OnIsContentGatedUpdated(bool IsContentGated);
	void OnByEpicUpdated(bool IsByEpic);
	void SetPurchaseRequired(bool IsPurchaseRequired);
	void Set_Image_Spinner_State(EActivityImageLoadingState InImageState);
	void SetImageErrorState(EActivityImageLoadingState ImageLoadState);
	void SetCCUCount(int32 CCUCount);
	void SetIsFavorite(bool IsFavorited);
	void Set_Image_State(EActivityImageLoadingState LoadingEnum);
	void Set_Image_Success_State();
	void SetFriendsPlayingCount(int32 FriendsPlayingCount);
	void BP_OnReleased();
	void OnRespondToTileViewVisibilityChange(bool bIsVisible);
	void OpenInfoModal();
	void OnModalDismissed(int32 ButtonIndex);
	void AddContextMenuItems();
	void WrapperCleanupContextMenuOnRelease();
	void BP_OnEntryReleased();
	void GoToLobby();
	void MoreFromCreator();
	void ViewDetails();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void AddRecommendedModalToContextMenu();
	void ToggleFavorite();
	void Set_Up_Favorite_Interaction(bool IsFavorited);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void OnTileActiveSet(const bool bIsTileActive);
	void BP_OnClicked();

	void __17bf98a4_4533_78f4_90a0_50ba916912d2_SourceToDest(class UWidget** VisibleWidget) const;
	void SetCreatorLogoOverrideVisible(EActivityImageLoadingState CreatorLogoLoadingState, class UTexture* CreatorLogoTexture, class UWidget** VisibleWidget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IslandTile_Minimal_C">();
	}
	static class UWBP_IslandTile_Minimal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IslandTile_Minimal_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UWBP_IslandTile_Minimal_C) == 0x000010, "Wrong alignment on UWBP_IslandTile_Minimal_C");
static_assert(sizeof(UWBP_IslandTile_Minimal_C) == 0x0017E0, "Wrong size on UWBP_IslandTile_Minimal_C");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, UberGraphFrame) == 0x001710, "Member 'UWBP_IslandTile_Minimal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, FortActivityViewModel) == 0x001718, "Member 'UWBP_IslandTile_Minimal_C::FortActivityViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Anim_OnHoverUnhoverRehover) == 0x001720, "Member 'UWBP_IslandTile_Minimal_C::Anim_OnHoverUnhoverRehover' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Anim_OnLoadedImage) == 0x001728, "Member 'UWBP_IslandTile_Minimal_C::Anim_OnLoadedImage' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, ByEpicLogo) == 0x001730, "Member 'UWBP_IslandTile_Minimal_C::ByEpicLogo' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, CMS_CreatorLogo) == 0x001738, "Member 'UWBP_IslandTile_Minimal_C::CMS_CreatorLogo' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, ErrorIcon) == 0x001740, "Member 'UWBP_IslandTile_Minimal_C::ErrorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, HorizontalBox_AddSqueegeeWhenNoCCU) == 0x001748, "Member 'UWBP_IslandTile_Minimal_C::HorizontalBox_AddSqueegeeWhenNoCCU' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, LockSlot) == 0x001750, "Member 'UWBP_IslandTile_Minimal_C::LockSlot' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, NestedSlot_OutsideContent) == 0x001758, "Member 'UWBP_IslandTile_Minimal_C::NestedSlot_OutsideContent' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Overlay_AddSqueegeeWhenCCU) == 0x001760, "Member 'UWBP_IslandTile_Minimal_C::Overlay_AddSqueegeeWhenCCU' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, SqueegeeSlot_Lock) == 0x001768, "Member 'UWBP_IslandTile_Minimal_C::SqueegeeSlot_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, SqueegeeSlot_Tag) == 0x001770, "Member 'UWBP_IslandTile_Minimal_C::SqueegeeSlot_Tag' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, StatusIndicator_Favorite) == 0x001778, "Member 'UWBP_IslandTile_Minimal_C::StatusIndicator_Favorite' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Switcher_Logo) == 0x001780, "Member 'UWBP_IslandTile_Minimal_C::Switcher_Logo' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Switcher_SqueegeeLockOrFavorite) == 0x001788, "Member 'UWBP_IslandTile_Minimal_C::Switcher_SqueegeeLockOrFavorite' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, Switcher_STWLockOrHighlight) == 0x001790, "Member 'UWBP_IslandTile_Minimal_C::Switcher_STWLockOrHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, TileThumbnail) == 0x001798, "Member 'UWBP_IslandTile_Minimal_C::TileThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, WBP_Discover_Tile_Base) == 0x0017A0, "Member 'UWBP_IslandTile_Minimal_C::WBP_Discover_Tile_Base' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, WBP_UIKit_Badge) == 0x0017A8, "Member 'UWBP_IslandTile_Minimal_C::WBP_UIKit_Badge' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, WBP_UIKit_Highlight) == 0x0017B0, "Member 'UWBP_IslandTile_Minimal_C::WBP_UIKit_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, TextureParam) == 0x0017B8, "Member 'UWBP_IslandTile_Minimal_C::TextureParam' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, ThumbnailDisabledOverlay) == 0x0017BC, "Member 'UWBP_IslandTile_Minimal_C::ThumbnailDisabledOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, IsOldDiscoverCode) == 0x0017C0, "Member 'UWBP_IslandTile_Minimal_C::IsOldDiscoverCode' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, IsFullTile) == 0x0017C1, "Member 'UWBP_IslandTile_Minimal_C::IsFullTile' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, DisableCornerInfo) == 0x0017C2, "Member 'UWBP_IslandTile_Minimal_C::DisableCornerInfo' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, IsTileInCreatorPage) == 0x0017C3, "Member 'UWBP_IslandTile_Minimal_C::IsTileInCreatorPage' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, RecommendModalName) == 0x0017C4, "Member 'UWBP_IslandTile_Minimal_C::RecommendModalName' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, IsRecommendedModal) == 0x0017C8, "Member 'UWBP_IslandTile_Minimal_C::IsRecommendedModal' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, ContextMenuFavoriteName) == 0x0017CC, "Member 'UWBP_IslandTile_Minimal_C::ContextMenuFavoriteName' has a wrong offset!");
static_assert(offsetof(UWBP_IslandTile_Minimal_C, AllowTileClicks) == 0x0017D0, "Member 'UWBP_IslandTile_Minimal_C::AllowTileClicks' has a wrong offset!");

}

